import 'package:flutter/material.dart';
import 'package:mzaodina_app/core/resources/resources.dart';
import 'package:mzaodina_app/feature/profile/view/widget/custom_appbar_accounet.dart';

class TermsAndConditionsScreen extends StatelessWidget {
  const TermsAndConditionsScreen({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: R.colors.whiteLight,

      body: Padding(
        padding: EdgeInsets.only(right: 16, left: 16, bottom: 21),
        child: Column(
          children: [
            CustomAppBarAccount(title: 'الشروط والاحكام'),
            Expanded(
              child: SingleChildScrollView(
                child: Column(
                  crossAxisAlignment: CrossAxisAlignment.start,
                  children: [
                    Padding(
                      padding: const EdgeInsets.only(bottom: 8.0),
                      child: Text(
                        'المقدمة',
                        style: R.textStyles.font18blackW500Light,
                      ),
                    ),
                    Text(
                      termsList[0],
                      style: R.textStyles.font14Grey3W500Light.copyWith(
                        height: 1.5,
                      ),
                    ),
                    SizedBox(height: 18),
                    Padding(
                      padding: const EdgeInsets.only(bottom: 8.0),
                      child: Text(
                        'أحكام المنصة',
                        style: R.textStyles.font18blackW500Light,
                      ),
                    ),
                    Text(
                      termsList[1],
                      style: R.textStyles.font14Grey3W500Light.copyWith(
                        height: 1.5,
                      ),
                    ),
                    SizedBox(height: 18),
                    Padding(
                      padding: const EdgeInsets.only(bottom: 8.0),
                      child: Text(
                        'وصف الخدمة',
                        style: R.textStyles.font18blackW500Light,
                      ),
                    ),
                    Text(
                      termsList[2],
                      style: R.textStyles.font14Grey3W500Light.copyWith(
                        height: 1.5,
                      ),
                    ),
                    SizedBox(height: 18),
                    Padding(
                      padding: const EdgeInsets.only(bottom: 8.0),
                      child: Text(
                        'لتغييرات أو التعديلات على شروط الاستخدام',
                        style: R.textStyles.font18blackW500Light,
                      ),
                    ),
                    Text(
                      termsList[3],
                      style: R.textStyles.font14Grey3W500Light.copyWith(
                        height: 1.5,
                      ),
                    ),
                    SizedBox(height: 18),
                    Padding(
                      padding: const EdgeInsets.only(bottom: 8.0),
                      child: Text(
                        'التعريفات',
                        style: R.textStyles.font18blackW500Light,
                      ),
                    ),
                    Text(
                      termsList[4],
                      style: R.textStyles.font14Grey3W500Light.copyWith(
                        height: 1.5,
                      ),
                    ),
                    SizedBox(height: 18),
                    Padding(
                      padding: const EdgeInsets.only(bottom: 8.0),
                      child: Text(
                        'شروط الاستخدام',
                        style: R.textStyles.font18blackW500Light,
                      ),
                    ),
                    Text(
                      termsList[5],
                      style: R.textStyles.font14Grey3W500Light.copyWith(
                        height: 1.5,
                      ),
                    ),
                    SizedBox(height: 18),
                    Padding(
                      padding: const EdgeInsets.only(bottom: 8.0),
                      child: Text(
                        'الاستخدام المحظور',
                        style: R.textStyles.font18blackW500Light,
                      ),
                    ),
                    Text(
                      termsList[6],
                      style: R.textStyles.font14Grey3W500Light.copyWith(
                        height: 1.5,
                      ),
                    ),
                    SizedBox(height: 18),
                    Padding(
                      padding: const EdgeInsets.only(bottom: 8.0),
                      child: Text(
                        'الروابط إلى منصتنا',
                        style: R.textStyles.font18blackW500Light,
                      ),
                    ),
                    Text(
                      termsList[7],
                      style: R.textStyles.font14Grey3W500Light.copyWith(
                        height: 1.5,
                      ),
                    ),
                    SizedBox(height: 18),
                    Padding(
                      padding: const EdgeInsets.only(bottom: 8.0),
                      child: Text(
                        'الحماية من الفيروسات',
                        style: R.textStyles.font18blackW500Light,
                      ),
                    ),
                    Text(
                      termsList[8],
                      style: R.textStyles.font14Grey3W500Light.copyWith(
                        height: 1.5,
                      ),
                    ),
                    SizedBox(height: 18),
                    Padding(
                      padding: const EdgeInsets.only(bottom: 8.0),
                      child: Text(
                        'لتنازل عن المطالبات',
                        style: R.textStyles.font18blackW500Light,
                      ),
                    ),
                    Text(
                      termsList[9],
                      style: R.textStyles.font14Grey3W500Light.copyWith(
                        height: 1.5,
                      ),
                    ),
                    SizedBox(height: 18),
                    Padding(
                      padding: const EdgeInsets.only(bottom: 8.0),
                      child: Text(
                        'الالتزامات',
                        style: R.textStyles.font18blackW500Light,
                      ),
                    ),
                    Text(
                      termsList[10],
                      style: R.textStyles.font14Grey3W500Light.copyWith(
                        height: 1.5,
                      ),
                    ),
                    SizedBox(height: 18),
                    Padding(
                      padding: const EdgeInsets.only(bottom: 8.0),
                      child: Text(
                        'حقوق المالك',
                        style: R.textStyles.font18blackW500Light,
                      ),
                    ),
                    Text(
                      termsList[11],
                      style: R.textStyles.font14Grey3W500Light.copyWith(
                        height: 1.5,
                      ),
                    ),
                    SizedBox(height: 18),
                    Padding(
                      padding: const EdgeInsets.only(bottom: 8.0),
                      child: Text(
                        'حقوق الملكية',
                        style: R.textStyles.font18blackW500Light,
                      ),
                    ),
                    Text(
                      termsList[12],
                      style: R.textStyles.font14Grey3W500Light.copyWith(
                        height: 1.5,
                      ),
                    ),
                    SizedBox(height: 18),
                    Padding(
                      padding: const EdgeInsets.only(bottom: 8.0),
                      child: Text(
                        'الأمان',
                        style: R.textStyles.font18blackW500Light,
                      ),
                    ),
                    Text(
                      termsList[13],
                      style: R.textStyles.font14Grey3W500Light.copyWith(
                        height: 1.5,
                      ),
                    ),
                    SizedBox(height: 18),
                    Padding(
                      padding: const EdgeInsets.only(bottom: 8.0),
                      child: Text(
                        'التعديل',
                        style: R.textStyles.font18blackW500Light,
                      ),
                    ),
                    Text(
                      termsList[14],
                      style: R.textStyles.font14Grey3W500Light.copyWith(
                        height: 1.5,
                      ),
                    ),
                    SizedBox(height: 18),
                    Padding(
                      padding: const EdgeInsets.only(bottom: 8.0),
                      child: Text(
                        'المدة والإنهاء',
                        style: R.textStyles.font18blackW500Light,
                      ),
                    ),
                    Text(
                      termsList[15],
                      style: R.textStyles.font14Grey3W500Light.copyWith(
                        height: 1.5,
                      ),
                    ),
                    SizedBox(height: 18),
                    Padding(
                      padding: const EdgeInsets.only(bottom: 8.0),
                      child: Text(
                        'إخلاء المسؤولية',
                        style: R.textStyles.font18blackW500Light,
                      ),
                    ),
                    Text(
                      termsList[16],
                      style: R.textStyles.font14Grey3W500Light.copyWith(
                        height: 1.5,
                      ),
                    ),
                    SizedBox(height: 18),
                    Padding(
                      padding: const EdgeInsets.only(bottom: 8.0),
                      child: Text(
                        'سياسة الخصوصية',
                        style: R.textStyles.font18blackW500Light,
                      ),
                    ),
                    Text(
                      termsList[17],
                      style: R.textStyles.font14Grey3W500Light.copyWith(
                        height: 1.5,
                      ),
                    ),
                    SizedBox(height: 18),
                    Padding(
                      padding: const EdgeInsets.only(bottom: 8.0),
                      child: Text(
                        'المرجعية القضائية',
                        style: R.textStyles.font18blackW500Light,
                      ),
                    ),
                    Text(
                      termsList[18],
                      style: R.textStyles.font14Grey3W500Light.copyWith(
                        height: 1.5,
                      ),
                    ),
                    SizedBox(height: 18),
                    Padding(
                      padding: const EdgeInsets.only(bottom: 8.0),
                      child: Text(
                        'القابلية',
                        style: R.textStyles.font18blackW500Light,
                      ),
                    ),
                    Text(
                      termsList[19],
                      style: R.textStyles.font14Grey3W500Light.copyWith(
                        height: 1.5,
                      ),
                    ),
                    SizedBox(height: 18),
                    Padding(
                      padding: const EdgeInsets.only(bottom: 8.0),
                      child: Text(
                        'مجمل الاتفاق',
                        style: R.textStyles.font18blackW500Light,
                      ),
                    ),
                    Text(
                      termsList[20],
                      style: R.textStyles.font14Grey3W500Light.copyWith(
                        height: 1.5,
                      ),
                    ),
                    SizedBox(height: 18),
                    Padding(
                      padding: const EdgeInsets.only(bottom: 8.0),
                      child: Text(
                        'الإقرار',
                        style: R.textStyles.font18blackW500Light,
                      ),
                    ),
                    Text(
                      termsList[21],
                      style: R.textStyles.font14Grey3W500Light.copyWith(
                        height: 1.5,
                      ),
                    ),
                  ],
                ),
              ),
            ),
          ],
        ),
      ),
    );
  }
}

List<String> termsList = [
  "يعد استخدامك لمنصة مزاودين للمزادات بمثابة الإقرار التام والموافقة على قبول الشروط والأحكام المنصوص عليها في هذه الوثيقة (“الاتفاقية“). نحن نحتفظ بحقنا ووفقاً لتقديرنا الخاص بتغيير هذه الشروط من وقت لآخر، وعليه يتعين عليك الاطلاع على هذه الشروط والأحكام بصفة دورية. ولا يتوجب علينا الاتصال بك أو إعلامك أو تنبيهك بأي تغييرات تم إجراؤها على الشروط والأحكام. ويعتبر استمرار استخدامك لموقع وخدمات منصة مزاودين للمزادات بمثابة موافقة صريحة منك على الشروط والأحكام المطبقة في وقت استخدامك للمنصة.",

  "يرجى قراءة شروط الاستخدام هذه وأي سياسات أخرى للاستخدام بعناية والتأكد من العلم والفهم التام بها والمتاحة عبر منصة مزاودين للمزادات قبل البدء في استخدام موقع وخدمات المنصة باعتبارها تشكل مُجتمِعة أحكام منصتنا والتي تنظم استخدامكم للمنصة. إذا كنت لا توافق على شروط الاستخدام هذه، يجب عليك عدم استخدام المنصة.",

  "منصة مزاودين للمزادات هي منصة متخصصة في عرض وبيع السلع بالمزاد بشتى أنواعه في المملكة العربية السعودية.",

  "قد نقوم بمراجعة شروط الاستخدام هذه في أي وقت ووفقاً لتقديرنا المطلق عن طريق تعديل أو تغيير أي أو كل من هذه الشروط. في كل مرة ترغب في استخدام منصة مزاودين للمزادات، يرجى مراجعة شروط الاستخدام هذه للتأكد من فهمك للشروط التي تنطبق في ذلك الوقت.",

  "يقصد بالعبارات التالية الواردة أدناه المعاني الموضحة إزاء كل منها ما لم يقتضي السياق خلاف ذلك: المالك: منصة مزاودين للمزادات “منصة مزاودين للمزادات” أو “الموقع” أو “الموقع الالكتروني” أو “الإدارة” أو “نحن” أو “ضمير المتكلم” أو “ضمير الملكية“: تشير إلى منصة مزاودين للمزادات. البائع: مالك حق التصرف في السلعة أو المستأمن المخول ببيعها. مقدم الخدمة: الجهة المخولة بتنظيم المزاد نيابة عن البائع . المزايد: هو الشخص المعتبر قانوناً لدخول المزاد. المشتري: من رسا عليه المزاد. الحساب: المساحة المخصصة للمستخدمين في المنصة والتي تمكنهم من الانتفاع بخدمات منصة مزاودين للمزادات. المستخدم: هو الشخص أو من ينوب عنه الذي يقوم بإنشاء حساب على المنصة، ويقوم باستخدامها والانتفاع منها. السلعة: كل المنتجات الملموسة والغير ملموسة المعروضة في المنصة. شروط البيع الخاصة: هي الشروط الخاصة التي يقوم بوضعها البائع أو مقدم الخدمة. مبلغ المشاركة بالمزاد: دفعة مالية تدفع عند الرغبة بالمشاركة في المزاد غير مستردة . الإجراءات المقررة: الإجراءات المقررة من البائع أو مقدم الخدمة، بغرض تنظيم المزاد والبيع. المعلومات: أي معلومات سرية ومعلومات شخصية أو معلومات أخرى تتعلق بحساب المستخدم والبائع والمشتري. الاتفاقية: تشير إلى هذه الوثيقة وما تتضمنه من شروط وأحكام، وكذلك سياسة الخصوصية، وكافة الاتفاقيات والسياسات المكملة والمنفذة لاتفاقك معنا.",

  "يوافق المستخدم على الدخول إلى المنصة واستخدامها فقط لأغراض مشروعة. ويتحمل المستخدم منفرداً مسؤولية معرفة والتقيد بكافة القوانين واللوائح والقوانين والنظم المتعلقة باستخدامه للمنصة. وبدخول المستخدم للمنصة فإنه يوافق على ما يلي: إنشاء حساب رسمي على المنصة يشتمل على معلومات المستخدم الشخصية. يشترط لوصولك واستخدامك للمنصة أن توافق على أنك تتمتع بالأهلية القانونية اللازمة للدخول معنا في هذه الاتفاقية، وأنك تبلغ من العمر 18 عام على الأقل. عدم إساءة استخدام المنصة بأي شكل كان. عدم تمثيل الغير أثناء استخدام المنصة إلا بموجب وثيقة قانونية تخول بذلك. عدم نشر أو نقل أي محتوى غير قانوني بما في ذلك محتوى يتضمن تفرقة عنصرية أو تشهير أو إزعاج أو قدح أو إهانة أو عمل فاحش أو غير أخلاقي أو أي محتوى أخر يمس بالدين أو الشريعة الإسلامية أو الأنظمة أو السياسة العامة للمملكة العربية السعودية. عدم استخدام المنصة لتحميل أي محتوى يتضمن فيروسات أو ملفات أو برامج أو أدوات قد تعدل أو تسبب ضرراً أو تعيق عمل الموقع الإلكتروني. عدم نشر أو نقل أي إعلانات تطفلية أو مواد ترويجية أو أي شكل آخر من أشكال الترغيب. عدم الإخلال أو نشر أية مواد تخل بحقوق الملكية الفكرية أو غيرها. عدم جمع أو حفظ معلومات شخصية عن الآخرين. تسجيل الاشتراك والعضوية في منصة مزاودين للمزادات غير مجانية . يمكن لجميع المستخدمين الاستفادة من خدمات منصة مزاودين للمزادات، وفي حالة قيامك بإنشاء حساب لدينا فأنت مُلزم بتقديم معلومات كاملة وصحيحة ودقيقة من حيث الاسم ورقم الهاتف والبريد الإلكتروني وغيرها من البيانات المطلوبة، وتكون مسئولاً عن مراجعة تلك المعلومات بشكل دوري بغرض تصحيحها أو تعديلها أو تحديثها كلما توفرت لديك معلومات جديدة بشأنها، وتتحمل المسئولية الكاملة عن عدم موثوقية هذه البيانات أو أي خطأ فيها. أنت المسئول عن المحافظة على المعلومات السرية الخاصة بحسابك، وأنك المسئول عن أي إفصاح للغير عن هذه المعلومات، كما أنك المسئول عن أي استخدام يقع من أي شخص تم الإفصاح له عن هذه المعلومات السرية. أنت توافق على أن جميع الأنشطة التي تحدث تحت حسابك مصرحاً بها من قبلك.",

  "يحظر على جميع المستخدمين الآتي: استخدام المنصة أو أي خدمة تقدم بطريقة غير قانونية أو احتيالية أو لخرق أي قوانين معمول بها أو اللوائح أو الأنظمة المحلية والدولية أو القواعد العرفية المطبقة، أو على النحو الذي نقدره. استخدام المنصة أو الخدمة أو المحتوى بأي شكل من الأشكال -وفقاً لتقديرنا الخاص- بطريقة تتسبب في جرح سمعتنا أو العلامة التجارية الخاصة بنا. استخدام المنصة للتعدي على أو انتهاك حقوق الملكية الفكرية المتعلقة بنا أو بالآخرين. نشر أي محتوى أو رسائل تمس الذات الإلهية أو الشخصيات المعتبرة أو تتسم بالتمييز العنصري، أو التمييز في الدين أو العرق أو السن أو الأصل القومي أو الإعاقة، أو تحتوي على سب وقذف أو ألفاظ نابية أو مضايقة أو سوء معاملة، أو تنافي تعاليم الدين الإسلامي، أو تُخل بالآداب العامة. نشر أي مواد تحتوي على فيروسات أو أي برامج أخرى ضارة أو أية شفرات خبيثة أو ملفات أو برامج حاسوبية أخرى مصممة للإضرار بالتشغيل العادي للخدمة (أو أي جزء منها) أو التدخل فيه أو تحديده، أو لأي برمجيات أو أجهزة حاسوبية أخرى. جمع أو تعقب المعلومات الشخصية للآخرين؛ لأي غرض. نشر الرسائل أو المراسلات الإلكترونية غير المرغوب فيها أو ما شابه ذلك. نشر أو بث أو إدخال أي مواد تحتوي على فيروسات أو أي برامج أخرى ضارة (Trojans، Worms، Logic Bombs، Time Bombs، Keystroke Loggers، Spyware، Adware) أو أية شفرات خبيثة أو ملفات أو برامج حاسوبية أخرى مصممة للإضرار بالتشغيل العادي للخدمة (أو أي جزء منها) أو التدخل فيه أو تحديده، أو لأي برمجيات أو أجهزة حاسوبية أخرى. نحن نحتفظ بالحق في إنهاء استخدامك للخدمة في حال أي انتهاك أو قيامك بإحدى الاستخدامات المحظورة.",

  "يتم توفير روابط الاتصال الخاصة ببوابات و/أو مواقع ويب أخرى بغرض التسهيل على الزائر، ونحن غير مسئولين عن محتويات أو مصداقية البوابات و/أو المواقع التي نرتبط بها ولا نصادق على محتوياتها، وبذلك فإن استخدام أي من هذه الروابط للوصول إلى تلك المواقع أو البوابات يتم على مسئوليتك الخاصة بشكل كامل. وإذ نستهدف استبدال الروابط الإلكترونية المقطوعة - التي لا تعمل- بالمواقع الأخرى، وبما إننا لا نملك التحكم أو السيطرة على تلك الروابط؛ فإننا لا نضمن بأي حال أن تعمل هذه الروابط بصورة دائمة.",

  "إننا نبذل كل الجهود لفحص واختبار محتويات هذه المنصة في كل مراحل الإنتاج، وننصحك بأن تقوم دائما بتشغيل برنامج مضاد للفيروسات على كل المواد التي يتم إنزالها من الإنترنت. نحن لا نعتبر مسئولين عن أية خسارة أو انقطاع أو تلف لبياناتك أو جهاز الحاسب أو أي جهاز يستخدم للتصفح لديك والذي قد يحدث أثناء الاتصال بهذه المنصة أو عند استخدام مادة واردة من هذه المنصة.",

  "منصة مزاودين للمزادات والخدمات والمعلومات والمواد والوظائف المتاحة بها أو التي يمكن الوصول إليها من خلال المنصة يتم توفيرها لاستخدامكم الشخصي 'كما هي' و 'كما هي متاحة' دون أي إقرار أو وعود أو ضمانات من أي نوع. ولا يمكننا أن نضمن أو أن نتحمل المسؤولية عن أية انقطاعات أو أخطاء أو تجاوزات قد تنشأ عن استخدام هذه المنصة أو محتوياتها أو أي موقع يرتبط بها سواء كان ذلك بعلمنا أو بدون علمنا. إن أية اتصالات أو معلومات قد يقوم المستخدم بإرسالها من خلال هذه المنصة لن يكون له الحق في ملكيتها أو حق ضمان سريتها كما أن أي استخدام أو استخدام تفاعلي تتضمنه هذه المنصة لا تضمن أولا يقصد بها أن تضمن للمستخدم أي حقوق أو تراخيص أو أية امتيازات من أي نوع. كما أن تنازل منصة مزاودين للمزادات عن أي حق متاح لها ومحدد ضمن هذه الشروط في أحد الأماكن أو المناسبات لا يعني بأي حال تنازلاً تلقائياً وبشكل دائم عن أية حقوق في أماكن ومناسبات أخرى.",

  "يلتزم البائع بالشروط المقررة والمنشورة في المنصة. يلتزم البائع بسلامة السلعة من أي إشكالات أو أي عيوب ويضمن أن كل سلعة هي جديدة ولم تستخدم من قبل . التزامات المشارك في المزاد يلتزم المشارك بالمزاد بدفع مبلغ رسوم المشاركة بالمزاد قبل بدء المزاد وتعد الدفعة المقدمة للمشاركة بالمزاد جزءاً من رسوم المنصة ولا يحق له استردادها. التزامات المشتري يلتزم المشتري بالشروط المقررة المنشورة في المنصة. يلتزم المشتري بأنه شاهد السلعة المشتراة وقبلها بحالتها الراهنة وعاينها معاينة نافية للجهالة ومسقطة لحقه في ادعاء الغبن أو الضرر أو الجهالة مهما كانت الأسباب. وهو بكامل أهليته المعتبرة شرعاً ونظاماً وبرضاه الصحيح. تعد الدفعة المقدمة للمشاركة بالمزاد جزءاً من رسوم المنصة ولا يحق له استردادها. يلتزم المشتري بإكمال الثمن المتبقي للسلعة المشتراة بحسب الشروط المقررة. يلتزم المشتري مسؤولاً مسؤولية كاملة عن صحة العنوان، ويتحمل كافة الرسوم المفروضة على المنصة بسبب إدخاله للعنوان بشكل خاطئ . في حال لم يستلم المشتري السلعة من شركات الشحن وتم ارجاع السلعة للمصدر لا يحق له المطالبة بالسلعة ويسقط حقة في امتلاكها . الحقوق وحدود المسؤولية",

  "يحق له وفق رأيه المنفرد إنهاء أو تعليق استخدام المنصة بدون سابق إنذار لأي سبب كان بما في ذلك الإخلال بشروط الاستخدام أو أي عمل يتعارض مع المنصة، ويخالف الأخلاق العامة أو ما يعتبره المالك مخالفاً للقانون أو يضر بالآخرين. إيقاف المنصة عن العمل في إي وقت كان من أجل عمل التحديثات اللازمة أو جراء حدوث عطل فيها من دون اشعار المستخدم. تعديل شروط الاستخدام من وقت لآخر وسيقوم بنشر أي تعديل على شروط الاستخدام في المنصة. لن يخطر المالك زوار المنصة أو عملائها بأية تعديلات من خلال البريد الإلكتروني أو عناوين الاتصال الشخصية الأخرى. يتحمل مستخدم المنصة مسؤولية الاطلاع على شروط الاستخدام من وقت لآخر للتأكد من التزامه بها. تسري التعديلات اعتباراً من تاريخ نشرها على المنصة. يحق للمالك الانتفاع من أي معلومات مسجلة على المنصة تخص المستخدم. يحق للمالك فرض رسوم على المستخدم جراء استخدام المنصة.",

  "هذه المنصة مملوكة لمؤسسة مزاود اين للتجارة سجل تجاري رقم 1010984690 ، وهي مؤسسة مقرها بالمملكة العربية السعودية. وكل المواد المتوفرة في هذه المنصة بما في ذلك على سبيل المثال لا الحصر النصوص والرسومات التصويرية للمعلومات والبرمجيات (المحتويات) محمية بموجب حقوق النشر والعلامات التجارية وأشكال حقوق الملكية الأخرى. وعلى الجانب الآخر فلا يجوز بأي شكل من الأشكال بيع أو ترخيص أو تأجير أو تعديل أو نسخ أو استنساخ أو إعادة طبع أو تحميل أو إعلان أو نقل أو توزيع أو العرض بصورة علنية أو تحرير أو إنشاء أعمال مشتقة من أي مواد أو محتويات من هذه المنصة للجمهور أو لأغراض تجارية دون الحصول على الموافقة الخطية المسبقة من منصة مزاودين للمزادات بالمملكة العربية السعودية. باستثناء ما هو مصرح به صراحةً من قبل المالك. فإنك توافق على عدم بيع أو ترخيص أو تأجير أو تعديل أو توزيع أو نسخ أو إعادة إنتاج أو نقل أو عرض علني أو أداء أو نشر أو تكييف أو تحرير أو إنشاء أعمال مشتقة من المحتوى أو المواد الموجودة على هذه المنصة. يحظر استخدام المحتوى أو المواد الموجودة على هذه المنصة لأي غرض غير مسموح به صراحة في هذه الاتفاقية. العلامات التجارية منصة مزاودين للمزادات وكافة الشعارات المرتبطة بها والصور ورؤوس الصفحات وأيقونات الأزرار والرموز والبرمجيات والتصاميم والرسومات والنصوص والأسماء الخدمية هي علامات وتصميمات تجارية خاصة لمنصة مزاودين للمزادات. ويحظر إعادة إنتاجها أو توزيعها في أي وسيلة إعلامية أو إعلانية دون إذن كتابي منا. للإبلاغ عن أي انتهاك لحقوق النشر أو حقوق العلامة التجارية يرجى مراسلتنا على info@mzaodin.com روابط لمواقع الأطراف الثالثة. يمكنك الوصول إلى مواقع أخرى عبر روابط من منصة مزاودين للمزادات. هذه المواقع ليست تحت سيطرتنا ولا نتحمل أي مسئولية بأي شكل من الأشكال عن أي من محتوياتها. أنت توافق على أننا لن نكون طرفاً في أي معاملة أو عقد يمكنك الدخول فيه مع أي طرف ثالث. ولن نتحمل أي مسؤولية تجاهك عن أي خسارة أو ضرر قد تتعرض لها باستخدام تلك المواقع والخدمات الخاصة بالطرف ثالث. أنت توافق على عدم إشراكنا في أي نزاع قد يكون لديك مع أي موقع إلكتروني أو خدمة للطرف الثالث. إن استخدامك لمواقع الويب والطرف الثالث يكون على مسؤوليتك الخاصة. حدود المسؤولية الخدمات الإلكترونية التي تقدمها المنصة الإلكترونية لمنصة مزاودين للمزادات عبر الإنترنت والحصول على معلومات بشأن الدوائر والجهات الحكومية المختلفة يتم تقديمها فقط لتسهيل الإجراءات اليدوية، وبهذا تقر بعلمك الكامل بأن الاتصالات عبر شبكة الإنترنت قد تتعرض للتدخل أو الاعتراض بواسطة الغير، وأن المنصة لا تستبدل المعلومات المتوفرة من خلال الجهات الرسمية وأن الطلبات والإجراءات الإدارية يمكن اتخاذها مباشرة أمام الجهات المختصة. وعليه، فان اللجوء إلى هذه المنصة يظل على مسئوليتك الخاصة، ونحن لا نكون بأي حال من الأحوال مسئولين عن أية خسارة أو ضرر من أي نوع قد تتكبده بسبب استخدامك أو زيارتك للمنصة أو اعتمادك على أي بيان أو رأي أو إعلان في المنصة أو ما قد ينجم عن أي تأخير في التشغيل أو تعثر الاتصال أو مشاكل الدخول إلى شبكة الإنترنت أو أعطال المعدات أو البرامج أو سلوك أو أفكار أي شخص يدخل إلى هذه المنصة. وبهذا تقر هنا وتوافق على أن وسيلتكم الحصرية والوحيدة لعلاج أي ضرر أو خسارة قد تحدث نتيجة دخولك أو استخدامك لهذه المنصة هي الامتناع عن استخدامها أو الدخول إليها أو عدم الاستمرار في ذلك.",

  "الالتزام بتوفير الأمان لمنصة مزاودين للمزادات وموظفيها ووكلائها وحمايتهم من أي ضرر قد يلحق بهم جراء أي مطالبات أو خسائر أو أعطال أو تكاليف أو نفقات، تحدث بسبب انتهاكك لاتفاقية المستخدم أو خرقك لأي قانون.",

  "يجوز لنا، حسب تقديرنا الخاص، تغيير أو تعديل أي جزء من هذه الاتفاقية في أي وقت عن طريق نشر الشروط المعدلة على منصة مزاودين للمزادات واستخدامك لمنصتنا بعد التاريخ الفعلي لتحديث الاتفاقية أو الشروط الأخرى يشكل موافقتك على الشروط وقت استخدامك. يرجى مراجعة هذه الاتفاقية من وقت لآخر قبل استخدام خدماتنا.",

  "الإنهاء من قبل منصة مزاودين للمزادات: نحن نحتفظ بالحق، ووفقاً لتقديرنا الخاص، في إنهاء أو تقييد أو إيقاف أي مستخدم من الوصول إلى المنصة أو استخدامه بدون إشعار ولأي سبب كان وبدون إبداء أي سبب، أو أي سلوك قد نعتبره غير قانوني أو ضار بالآخرين. بما في ذلك على سبيل المثال لا الحصر، إذا كنا نعتقد لأسباب معقولة بأنك انتهكت سياسة الاستخدام أو أي سياسة أخرى ذات صلة، أو أنك تشكل خطراً أو تعرضنا لمخاطر قانونية محتملة. الإنهاء من قبلك: إذا لم تكن راضياً عن منصتنا أو خدماتنا الحل المتوفر لك هو التوقف عن استخدام المنصة.",

  "أنت توافق صراحة على أن استخدامك للمنصة يقع على مسؤوليتك الشخصية إلى الحد الأقصى المسموح به بموجب القانون. أنت توافق على تعويضنا عن أي خسائر أو أضرار ناتجة عن عدم الامتثال لهذه الشروط والأحكام أو بسبب قيامك بانتهاك هذه الشروط والأحكام، ويجب أن تتحمل تكاليف ونفقات الدعاوى المباشرة وغير المباشرة أياً كانت. يخلي المالك مسؤوليته في الحالات التالية: ضمان خلو المنصة أو الخادم الخاص بها من الأخطاء أو الانقطاع، أو الوصول غير المصرح به، أو لتلبية متطلباتك لأي سبب كان. تقديم ضمانات بأن المنصة أو الخوادم الخاصة بها أو أي رسائل مُرسلة خالية من الفيروسات أو غيرها من المكونات الضارة. أي تبعات قانونية تترتب على بيع منتجات أو سلعة من قبل مقدم الخدمة غير مصرح ببيعها أو عليها مشكلات تحت أي سبب من الأسباب. اختراق حساب المستخدم وما يترتب على ذلك من تبعات قانونية. المطالبات بين الأطراف سواءً بين المستخدم ومقدم الخدمة أو العكس وأنماء يرجع الأمر للجهات الرسمية. لا يقدم المالك أي نوع من التعهدات أو الضمانات بشأن المواد والمعلومات المتضمنة في المنصة ويعتبر استعمال المستخدم للمنصة على مسؤوليته الخاصة. في حال عمد الوفاء بالتزاماتك تجاه البائع بموجب عقد البيع، فستكون في حالة تقصير ويحق للبائع إلغاء عقد البيع، وقد يترتب عليك تعويض البائع عن الأضرار الناتجة عن عدم التزامك. تحمل أية مسؤولية عن أي استخدام لأي محتوى مستخدم تم وضعه أو تخزينه أو رفعه من قبلك أو من قبل أي طرف ثالث أو عن أي خسارة أو أضرار قد تلحق بمحتوى المستخدم. المسؤولية عن أي خرق للبيانات بسبب هجوم القراصنة. الالتزام فيما يتعلق بمقدار الوقت اللازم لإتمام معالجة أي معاملة معينة وأيضاً مسؤولية أي خسارة مباشرة أو غير مباشرة ناجمة عن أي تأخير من هذا القبيل، حيث أننا نبذل الجهود المعقولة لضمان أن جميع المعاملات تتم معالجتها في الوقت المناسب.",

  "خصوصيتكم تهمنا ، ونحن نقدر الثقة التي وضعتموها فينا، وملتزمون بحماية وأمان أية معلومات شخصية تقدمونها لنا، لذا فإن جميع المعلومات الخاصة بعملاء مزاودين للمزادات تخضع لخصوصية كاملة، ولن يتم استخدام أي جزء من المعلومات الا بما يخدم بعض خصائص المنصة مثل احصائيات زوار المنصة واستخدامها في الحملات الترويجية والتسويقية الخاصة بالمنصة، كما يمكن توثيق بعض الأنشطة والصور على مواقعنا الإلكترونية الخاصة بالتواصل الاجتماعي، أو على المنصة الالكترونية الخاص بمزاودين للمزادات، مثل الصور الفوتوغرافية الخاصة بالفائزين أو المشاركين في المزادات الخاصة بي المنصة.",

  "بهذا توافق على الخضوع حصريًا للقوانين واللوائح المعمول بها من السلطات القضائية بالمملكة العربية السعودية وتفسر وفقاً لها فيما يتعلق بأي نزاعات أو مطالبات أو خلافات تنشأ عن شروط الاستخدام أو تتعلق بأي انتهاك أو إنهاء أو تنفيذ أو تفسير أو صلاحية أو استخدام تنشأ عن استخدامك لهذه المنصة، علماً بأن اللغة العربية ستكون هي اللغة الرسمية المستخدمة لحل أية خلافات تنشأ عن استخدامك للمنصة أو أي من محتوياتها.",

  "لا يؤثر بطلان أو عدم قابلية تنفيذ أي بند من أحكام هذه الاتفاقية على صلاحية أو إنفاذ أي حكم آخر. ويعتبر أي بند غير صالح أو غير قابل للتنفيذ مقطوعاً من هذه الاتفاقية إلى حد عدم صلاحيته أو عدم قابليته للتنفيذ، ويجب تفسير هذه الاتفاقية وتنفيذها كما لو أن الاتفاقية لم تتضمن هذا البند الخاص إلى حد عدم صلاحيته أو عدم قابليته للتنفيذ. لا يؤثر بطلان أو عدم قابلية تنفيذ أي بند من أحكام هذه الاتفاقية على صلاحية أو إنفاذ أي حكم آخر. ويعتبر أي بند غير صالح أو غير قابل للتنفيذ مقطوعاً من هذه الاتفاقية إلى حد عدم صلاحيته أو عدم قابليته للتنفيذ، ويجب تفسير هذه الاتفاقية وتنفيذها كما لو أن الاتفاقية لم تتضمن هذا البند الخاص إلى حد عدم صلاحيته أو عدم قابليته للتنفيذ.",

  "تمثل شروط الاستخدام وأية سياسات أو قواعد تشغيل نُشرت من قبلنا على هذا المنصة أو فيما يتعلق بالخدمات الاتفاق والتفاهم الكامل بينك كمستخدم وبين منصة مزاودين للمزادات والتي تحكم استخدامك للخدمة وتحل محل أية اتفاقيات سابقة فيما يتعلق بموضوع هذه الاتفاقية، سواء مكتوبة أو شفوية. في حال لم نتمكن من تطبيق أي حق أو مادة من شروط الخدمة هذه فإن هذا لا يعد تنازلاً منا عنها. في حال اعتبار أي بند من أحكام هذه الاتفاقية غير قانوني أو غير صالح أو غير قابل للتنفيذ، سواء كليًّا أو جزئيًّا، بموجب أي قانون، فلا يعد هذا الحكم أو جزء منه، وفق الحدود التي لا يعتبر هذا الحكم أو جزء منه يشكل جزءاً من هذه الاتفاقية، دون أن تتأثر قانونية وسريان وقابلية تنفيذ الأحكام الأخرى الواردة في هذه الاتفاقية.",

  "بناءً على ما تم ذكره بمجرد الدخول على المنصة يقر المستخدم بأنه اطلع على كافة الشروط والاحكام، وأنه من خلال انشاء الحساب في المنصة بمعلوماته الشخصية الرسمية فأنه يقر بالموافقة على ما تم ذكره سلفاً موافقة تامة.",
];
