import 'package:flutter/material.dart';
import 'package:mzaodina_app/core/resources/resources.dart';
import 'package:mzaodina_app/feature/profile/view/widget/custom_appbar_accounet.dart';

class PrivacyPolicyScreen extends StatelessWidget {
  const PrivacyPolicyScreen({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      backgroundColor: R.colors.whiteLight,

      body: Padding(
        padding: EdgeInsets.only(right: 16, left: 16, bottom: 21),
        child: Column(
          children: [
            CustomAppBarAccount(title: 'سياسة الخصوصية'),
            Expanded(
              child: SingleChildScrollView(
                child: Column(
                  crossAxisAlignment: CrossAxisAlignment.start,
                  children: [
                    Padding(
                      padding: const EdgeInsets.only(bottom: 8.0),
                      child: Text(
                        'سياسة الخصوصية',
                        style: R.textStyles.font18blackW500Light,
                      ),
                    ),
                    Text(
                      privacyPolicyList[0],
                      style: R.textStyles.font14Grey3W500Light.copyWith(
                        height: 1.5,
                      ),
                    ),
                    SizedBox(height: 18),
                    Padding(
                      padding: const EdgeInsets.only(bottom: 8.0),
                      child: Text(
                        'أمن المعلومات الشخصية',
                        style: R.textStyles.font18blackW500Light,
                      ),
                    ),
                    Text(
                      privacyPolicyList[1],
                      style: R.textStyles.font14Grey3W500Light.copyWith(
                        height: 1.5,
                      ),
                    ),
                    SizedBox(height: 18),
                    Padding(
                      padding: const EdgeInsets.only(bottom: 8.0),
                      child: Text(
                        'حماية خصوصيتك',
                        style: R.textStyles.font18blackW500Light,
                      ),
                    ),
                    Text(
                      privacyPolicyList[2],
                      style: R.textStyles.font14Grey3W500Light.copyWith(
                        height: 1.5,
                      ),
                    ),
                  ],
                ),
              ),
            ),
          ],
        ),
      ),
    );
  }
}

List<String> privacyPolicyList = [
  '''تضع منصة مزاودين للمزادات سرية معلومات مستخدميها وزوارها على رأس قائمة الأولويات، وتبذل إدارة المنصة كل جهودها لتقديم خدمة ذات جودة عالية لكل المستفيدين، وتعتبر الخصوصية وسرية المعلومات الموضحة ادناه جزءاً من شروط استخدام المنصة الإلكترونية لمنصة مزاودين للمزادات وأحكامها.
لا تقوم منصة مزاودين للمزادات بجمع معلومات شخصية عنك عندما تقوم بزيارة بوابتها إلا إذا اخترت تحديداً وبمعرفتك تقديم هذه المعلومات لنا. إذا اخترت تقديم معلوماتك، فإننا لا نستخدمها إلا لإنجاز طلبك للحصول على معلومات أو خدمات وفق ما ورد في هذه السياسات، وباستخدامك لمنصة مزاودين للمزادات فإنك توافق على سياسة الخصوصية وسرية المعلومات هذه.
يجب على زوار المنصة والمستفيدين من خدماتها الاطلاع بشكل مستمر على شروط ومبادئ الخصوصية وسرية المعلومات لمعرفة أية تحديثات تتم عليها، علماً بأن إدارة المنصة غير مطالبة بالإعلان عن أية تحديثات تتم على تلك الشروط والمبادئ، ويعني استخدامك للمنصة اطلاعك وموافقتك على تلك الشروط والمبادئ وما يتم عليها من تعديلات مستمرة.
منصة مزاودين للمزادات غير مسئولة تحت أي ظرف من الظروف عن أي أضرار مباشرة أو غير مباشرة أو عرضية أو تبعية أو خاصة أو استثنائية تنشأ عن استخدام أو عدم القدرة على استخدام هذه المنصة.''',

  '''تم إعداد وثيقة الخصوصية وسرية المعلومات لمساعدة الزوار والمستخدمين على تفهم طبيعة البيانات التي يتم جمعها منهم عند زيارة المنصة وكيفية التعامل معها. تقوم إدارة المنصة باتخاذ الإجراءات والتدابير المناسبة والملائمة للمحافظة على المعلومات الشخصية التي لديها بشكل آمن يضمن حمايتها من الفقدان أو الدخول غير المصرح به أو إساءة الاستخدام، أو التعديل والإفصاح غير المصرح بهما، ومن أهم التدابير المعمول بها في منصة مزاودين للمزادات لحماية معلومات الزائر الشخصية:
الإجراءات والتدابير المشددة لحماية أمن المعلومات والتقنية التي نستخدمها للوقاية من عمليات الاحتيال والدخول غير المصرح به إلى أنظمتنا. التحديث المنتظم والدوري لإجراءات وضوابط الحماية التي تفي أو تزيد عن المعايير القياسية. إن موظفينا مؤهلون ومدربون على احترام سرية المعلومات الشخصية لزائرينا. جمع المعلومات الشخصية
بمجرد زيارة المستخدم لمنصة مزاودين للمزادات، يقوم الخادم الخاص بمنصة مزاودين للمزادات بتسجيل عنوان بروتوكول شبكة الإنترنت IP الخاص بالمستخدم وتاريخ ووقت الزيارة والعنوان URL الخاص بأي موقع إلكتروني تتم منه إحالتك إلى منصة مزاودين للمزادات.
تضع معظم المواقع الإلكترونية بمجرد أن تتم زيارتها ملفاً صغيراً على القرص الصلب الخاص بجهاز الزائر (المتصفح)، ويسمى هذا الملف "كوكيز" (Cookies)، وملفات الكوكيز عبارة عن ملفات نصية، وتحتوي هذه الملفات النصية على معلومات تتيح للموقع الذي أودعها أن يسترجعها عند الحاجة لها خلال زيارة المستخدم المقبلة للموقع ومن هذه المعلومات المحفوظة:
تذكر اسم مستخدم وكلمة مرور.
حفظ إعدادات الصفحة في حال كان ذلك متاح على المنصة.
حفظ الألوان التي تم اختيارها من قبل المستخدم.
عدم إتاحة إمكانية التصويت أكثر من مرة لنفس المستخدم.
قد لا يضطر المتصفح (الزائر) إلى إدخال كلمة المرور في كل زيارة إذ سيتمكن نظام الموقع من اكتشافها عن طريق ملفات الكوكيز، أو قد تمنع المستخدم من تكرار عملية التصويت إذا كان قد قام بالتصويت مسبقاً وهكذا... وعلى هذا الأساس فإن منصة مزاودين للمزادات ستستخدم المعلومات الموجودة في ملفات الكوكيز لأغراض فنية خاصة بها وذلك عند زيارتها أكثر من مرة، كما أن المنصة بإمكانها تغيير المعلومات الموجودة ضمن ملفات الكوكيز أو إضافة معلومات جديدة كلما قمت بزيارة منصة مزاودين للمزادات.
إذا قمت باستخدام منصتنا او متجرنا أو أرسلت لنا بريداً إلكترونيًا عبر المنصة الإلكترونية مزاودين للمزادات تزودنا فيه ببيانات شخصية، فإننا قد نتقاسم البيانات الضرورية مع جهات أو إدارات أخرى، وذلك لخدمتك بصورة أكثر فعالية، ولن نتقاسم بياناتك الشخصية مع الجهات غير الحكومية إلا إذا كانت من الجهات المصرح لها من الجهات المختصة بالقيام بأداء خدمات محددة. وبتقديمك لبياناتك ومعلوماتك الشخصية من خلال المنصة الإلكترونية لمنصة مزاودين للمزادات، فإنك توافق تمامًا على تخزين ومعالجة واستخدام تلك البيانات من قبل السلطات السعودية. ونحن نحتفظ بالحق في كل الأوقات في كشف أي معلومات للجهات المختصة، عندما يكون ذلك ضروريا للالتزام بأي قانون أو نظام أو طلب حكومي.
أنت مسئول بمفردك عن تمام وصحة وصدق البيانات التي ترسلها من خلال هذه المنصة.''',

  '''لكي نتمكن من مساعدتك في حماية معلوماتك الشخصية فإننا نوصي بما يلي:
الاتصال بنا بشكل فوري عندما تظن أن شخصاً ما استطاع الحصول على كلمة السر الخاصة بك، أو رمز الاستخدام، أو الرقم السري، أو أي معلومات سرية أخرى.
لا تعط معلومات سرية عبر الهاتف أو شبكة الإنترنت ما لم تعرف هوية الشخص أو الطرف المستقبل للمعلومة. ستخدم متصفح آمن عند قيامك بإنجاز المعاملات عبر الإنترنت مع إغلاق التطبيقات غير المستخدمة على الشبكة، وتأكد من أن برنامج الحماية من الفيروسات محدث على الدوام.
في حالة وجود أية استفسارات أو آراء حول مبادئ الخصوصية، يمكن التواصل مع إدارة المنصة عبر نموذج الاتصال في صفحة اتصل بنا.
للحفاظ على بياناتك الشخصية، يتم تأمين التخزين الإلكتروني والبيانات الشخصية المرسلة باستخدام التقنيات الأمنية المناسبة.
هذه المنصة قد تحتوي على روابط إلكترونية لمواقع أو بوابات قد تستخدم طرقًا لحماية المعلومات وخصوصياتها تختلف عن الطرق المستخدمة لدينا، ونحن غير مسئولين عن محتويات وطرق وخصوصيات هذه المواقع الأخرى، وننصحك بالرجوع إلى إشعارات الخصوصية الخاصة بتلك المواقع إرسال الرسائل الإلكترونية
عندما تقوم بالاستفسار أو طلب معلومات حول خدمة محددة أو في حالة قيامك بإعطاء معلومات إضافية مستخدما أياً من وسائل الاتصال مع منصة مزاودين سواء كانت إلكترونية أو غير إلكترونية، مثل طلب الاستفسار على موقعنا، فإننا سنستخدم عنوان بريدك الإلكتروني للرد على استفساراتك، كما أنه من الممكن حفظ عنوان بريدك ورسالتك وإجابتنا عليها لأغراض مراقبة الجودة، كما أننا قد نقوم بذلك للغايات القانونية والرقابية.''',
];
